movies = [
    {
        "name": "瘋狂的石頭",
        "poster": "疯狂的石头1.png",
        "building": "长江索道1.png",
        "lines": [
            "城市是母體，而我們生活在她的子宮裡",
            "你當這是公共廁所邁，想來就來，想走就走"
        ]
    },
    {
        "name": "少年的你",
        "poster": ["少年的你1.jpg", "少年的你2.jpg"],
        "building": ["皇冠大扶梯1.png", "南滨路2.jpg"],
        "lines": [
            "我們生活在陰溝裡，但依然有人仰望星空。",
            "從來沒有一節課，教過我們如何變成大人。",
            "路上總會有陰影，抬頭就會看到星光。",
            "生活，就像夏天的柑橘樹，掛著青皮的果，苦是一定的，甜也有。",
            "你保護世界，我保護你。"
        ]
    },
    {
        "name": "日照重慶",
        "poster": "日照重庆1.jpg",
        "building": "朝天门码头1.png",
        "lines": [
            "船票過期了，可碼頭還在等一個沒靠岸的人"
        ]
    },
    {
        "name": "刺殺小說家",
        "poster": "刺杀小说家.jpg",
        "building": "白象居.png",
        "lines": [
            "如果在現實世界失去你，那就在平行世界重寫故事，讓我們再相遇。",
            "我相信，小說裡的世界和人，都存在。"
        ]
    },
    {
        "name": "鋌而走險",
        "poster": "铤而走险.jpg",
        "building": "李子坝.jpg",
        "lines": [
            "這城市像個迷宮，走錯一步就出不去了。",
            "在黑暗裡找路的人，不是被影子吞沒，就是把自己變成燈。"
        ]
    },
    {
        "name": "好奇害死貓",
        "poster": "好奇害死猫.jpg",
        "building": "老居民楼.png",
        "lines": [
            "貓雖有九條命, 最終卻死於好奇心",
            "窺見秘密的人，最後都成了秘密的獵物。"
        ]
    },
    {
        "name": "受益人",
        "poster": "受益人.jpg",
        "building": "来福士.jpg",
        "lines": [
            "窮人的謊話是石頭，咽下去沉胃，吐出來砸腳。"
        ]
    },
    {
        "name": "秘岸",
        "poster": "秘岸.jpg",
        "building": "弹子石码头.jpg",
        "lines": [
            "大人有些事情就不能跟小孩講。",
            "現在這些人最嚴重的問題，不是生理有病，而是心理有病，看上去都不怎麼開心的。",
            "疤也是肉長的，已經成為你身體的一部分了。",
            "每個人都需要心理的傾訴。"
        ]
    },
    {
        "name": "堅如磐石",
        "poster": "坚如磐石.jpg",
        "building": "千厮门大桥.png",
        "lines": [
            "你是一隻能過河的卒，只能進不能退。",
            "一條狗，吃過一口肉，就再也不想吃骨頭。"
        ]
    }
]